-- 1 задание
SELECT tv.ИД, v.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ tv
INNER JOIN Н_ВЕДОМОСТИ v ON tv.ИД = v.ТВ_ИД
WHERE tv.ИД < 2
  AND v.ИД > 39921;

-- 2 задание
SELECT l.ОТЧЕСТВО, o.ЧЛВК_ИД, u.ГРУППА
FROM Н_ЛЮДИ l
LEFT JOIN Н_ОБУЧЕНИЯ o ON l.ИД = o.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ u ON o.ЧЛВК_ИД = u.ЧЛВК_ИД AND o.ВИД_ОБУЧ_ИД = u.ВИД_ОБУЧ_ИД
WHERE l.ИМЯ > 'Ярослав'
  AND o.НЗК = '933232'
  AND u.НАЧАЛО > DATE ('2009-02-09');

-- 3 задание  
SELECT EXISTS ( 
    SELECT 1
    FROM Н_ЛЮДИ l
    JOIN Н_УЧЕНИКИ ON l.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_УЧЕНИКИ.ГРУППА = Н_ГРУППЫ_ПЛАНОВ.ГРУППА
    JOIN Н_ПЛАНЫ ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' 
        AND (l.ОТЧЕСТВО IS NULL OR l.ОТЧЕСТВО = '.')
);
-----------------------------------------------------
SELECT l.ОТЧЕСТВО, l.ФАМИЛИЯ, l.ИМЯ
FROM Н_ЛЮДИ l
JOIN Н_УЧЕНИКИ ON l.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_УЧЕНИКИ.ГРУППА = Н_ГРУППЫ_ПЛАНОВ.ГРУППА
JOIN Н_ПЛАНЫ ON Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' 
    AND (l.ОТЧЕСТВО IS NULL OR l.ОТЧЕСТВО = '.');

-- 4 задание
SELECT ПЛАН_ИД
FROM Н_ГРУППЫ_ПЛАНОВ
WHERE ПЛАН_ИД IN (
        SELECT ПЛАНЫ.ИД
        FROM Н_ПЛАНЫ ПЛАНЫ
        JOIN Н_ОТДЕЛЫ ОТДЕЛЫ ON ПЛАНЫ.ОТД_ИД = ОТДЕЛЫ.ИД
        WHERE ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
    )
GROUP BY ПЛАН_ИД
HAVING COUNT(DISTINCT ГРУППА) = 2;

-- 5 задание
SELECT h.ИД, AVG(CAST(ОЦЕНКА AS NUMERIC)) Средняя_оценка, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО
FROM Н_ЛЮДИ h
JOIN Н_УЧЕНИКИ s ON h.ИД = s.ЧЛВК_ИД AND s.ГРУППА = '4100'
JOIN Н_ВЕДОМОСТИ v ON v.ЧЛВК_ИД = h.ИД AND ОЦЕНКА NOT IN ('осв', 'неявка', 'зачет', 'незач')
GROUP BY h.ИД, ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО
HAVING AVG(CAST(ОЦЕНКА AS NUMERIC)) >= (
    SELECT AVG(CAST(ОЦЕНКА AS NUMERIC))
    FROM Н_УЧЕНИКИ s 
    JOIN Н_ВЕДОМОСТИ v ON s.ЧЛВК_ИД = v.ЧЛВК_ИД AND s.ГРУППА = '1100' AND ОЦЕНКА NOT IN ('осв', 'неявка', 'зачет', 'незач')
    )
ORDER BY Средняя_оценка DESC;

-- 6 задание
SELECT 
    u.ГРУППА,
    l.ИД,
    l.ФАМИЛИЯ,
    l.ИМЯ,
    l.ОТЧЕСТВО,
    u.П_ПРКОК_ИД AS Номер_приказа,
    u.СОСТОЯНИЕ AS Статус_приказа
FROM  Н_УЧЕНИКИ u
JOIN  Н_ЛЮДИ l ON l.ИД = u.ЧЛВК_ИД
WHERE u.НАЧАЛО > '2012-09-01'
    AND u.СОСТОЯНИЕ = 'утвержден'
    AND EXISTS (
        SELECT 1
        FROM Н_ПЛАНЫ p
        JOIN Н_ФОРМЫ_ОБУЧЕНИЯ fo ON p.ФО_ИД = fo.ИД
        JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ns ON p.НАПС_ИД = ns.ИД
        JOIN Н_НАПР_СПЕЦ n ON ns.НС_ИД = n.ИД
        WHERE p.ИД = u.ПЛАН_ИД
            AND fo.НАИМЕНОВАНИЕ IN ('Очная', 'Заочная')
            AND n.НАИМЕНОВАНИЕ = 'Программная инженерия'
            AND p.КУРС = '1'
    );
 
-- 7 задание
SELECT COUNT(DISTINCT(h.ИД)) FROM Н_ЛЮДИ h
JOIN Н_ВЕДОМОСТИ v ON h.ИД = v.ЧЛВК_ИД
JOIN Н_УЧЕНИКИ s ON v.ЧЛВК_ИД = s.ЧЛВК_ИД
JOIN Н_ПЛАНЫ p ON s.ПЛАН_ИД = p.ИД
JOIN Н_ОТДЕЛЫ o ON p.ОТД_ИД = o.ИД
WHERE o.КОРОТКОЕ_ИМЯ = 'КТиУ' AND v.ОЦЕНКА = '3';